// 星座的神话传说
export default {
    'baiyang': `
                传说，在一个古老的遥远国度中，国王和皇后因性格不合而离婚，并娶了另一名女子，可惜这位新皇后天生善于嫉妒，无法忍受国王对他前妻所留下的一双子女的百般疼爱，于是邪恶的阴谋逐渐在她脑中形成。
            春天来临，又到了播种耕种的季节，新皇后将炒熟了的麦子，发送给全国不知情的农夫。已经熟透了的麦子，无论怎样浇水、施肥，都无法发出芽来。被蒙在鼓里的农夫百思不得其解。
            新皇后就在此时，散播有关麦子的谣言，说麦子之所以无法发芽，就是因为这个国家受到了诅咒，而受到诅咒全都是因为王子和公主引起了天怒，导致天神对国家的处罚。
            白羊座
            白羊座
            不知情的农民们一听，天啊！这还得了！因为邪恶的王子和公主，全国的人民都将陷于贫穷饥饿的深渊中，这是一件多么可怕的事啊！
            很快地，全国各地无论男女老少，都一致要求国王一定要将王子与公主处死，解开这个诅咒，平息天怒，人民的辛苦耕种才会有收获，国家也才能回复过去的安定富足。
            国王虽心有不舍，但为了平息众怒，只好无奈地答应了人们的要求，准备将公主与王子处死，以换得人民的信任。这个消息传到了王子公主的生母耳中，当然是又惊又怕，赶紧向伟大的天神——宙斯求助。宙斯当然知道是皇后搞的鬼，于是就答应帮忙。在行刑的当天，天空突然出现一只有着金色长毛的公羊，将兄妹救走，就在飞行以过大海的途中，这只公羊一个不小心把妹妹摔下海中死掉了。
            后来宙斯为了奖励这只勇敢但又粗心的公羊，就将他高挂在天上，也就是今天大家所熟知的白羊座。`,
    'jinniu': `
            金牛座七姊妹星团（Pleiades）的故事
            七姊妹其实是阿特拉斯（Atlas）和普勒俄涅（Pleione）的七个女儿，分别是阿尔库俄涅（Alcyone），斯忒罗珀（Sterope），刻莱诺（Calaeno），
            厄勒克特拉（Electra），迈亚（Maia），墨罗佩（Merope）及塔宇革忒（Taygete），阿尔库俄涅及刻莱诺给波塞冬诱奸，最大的女儿迈亚替宙斯诞下了赫耳墨斯，
            并且成为阿卡斯（Arcas）的后母，厄勒克特拉替宙斯生下特洛伊的建城者达尔达诺斯（Dardanus），泰莱塔替宙斯生下斯巴达的建城者拉塞达埃蒙（Lacedaemon），
            斯忒罗珀被战神阿瑞斯强暴并诞下皮萨（Pisa）皇奥诺玛奥斯（Oenomaus），只有墨罗佩嫁给了平民西叙福斯。七姊妹星团中只可看到六颗，有说墨罗佩由于嫁予平民，故光芒最弱，
            又有说是因为埃勒克特拉用手掩盖自己的眼睛，不忍见到特洛伊的灭亡，可是事实上最暗的星哈泰迪敏。`,
    'shuangzi': `
                丽达王妃生了许多可爱的孩子，其中有两个兄弟，不光是感情特别要好，长相也几乎一模一样，很容易让人以为他们俩是一对双生子。 
            其实，在这两兄弟中，哥哥是丽达王妃与天神宙斯所生的儿子，弟弟则是斯巴达国王所生的，俩人为同母异父的兄弟，而且哥哥的身份是"神"，且有永恒的生命，弟弟则是一般的普通人。
            有一天，希腊遭到了一头巨大的野猪攻击，王子们召集许多的勇士去追杀野猪，当野猪顺利地被解决后，勇士之间却因为互争功劳，而在彼此之间结下了仇恨。
            在一次市集的热闹场合中，两边互看对方不顺眼的勇士不期而遇，当然又免不了一番争吵。在争吵中，有人开始动起武来，于是场面变得一发不可收拾，许多人都在这场打杀中受伤，甚至死亡。很不幸地，两位王子当中的弟弟，也是在这一场混乱之中，被杀身亡。
            一向与这个弟弟特别要好的哥哥，完全无法接受弟弟已经死亡的消息，抱着弟弟的尸首不停的痛哭，希望弟弟可以起死回生，让两人可以一起重享以前手足情深的欢乐日子。
            于是，哥哥回到天上向父亲宙斯请求，希望宙斯可以让弟弟复活。但是宙斯向他表示，弟弟只是个普通的人，本就会死，若是真的要让弟弟复活，就必须把哥哥剩余的生命分给弟弟。
            感情深厚的哥哥，当然是毫不犹豫的马上答应了，从此之后，兄弟俩又可以一起快乐的生活了。`,
    'juxie': `一
            传说在很久很久以前，赫五力大战蛇妖许德拉的时候，从海中升出一只巨蟹为帮助蛇妖咬了赫五力的脚踝，后来这只巨蟹被赫五力打死，落在了爱琴海的一座小岛上。巨蟹没有完成女神赫拉的任务，因而被诅咒，这诅咒便波及到了雅典王后的身上。在雅典公主美洛出生的时候，就有一位预言家预言，公主结婚的时候就是王后死亡的时候。为着这个预言，王后一直没有叫公主嫁人。直到美洛二十岁的时候，雅典城来了一位王子，名叫所飒。
            所飒是慕名而来，他一心想娶美洛为妻，而美洛在第一眼见到所飒时也深深的爱上了他。然而诅咒是可怕的，公主也不希望只为了自己的幸福去牺牲母亲的生命。于是她想尽办法阻止所飒也阻止自己的欲望。他定下了九关，就如同九个不可能完成的任务一样，除非所飒一一做到，他才可以迎娶美洛。然而，英勇无比的所飒竟一一做到了！公主陷入了两难的境地。伟大的母亲为了女儿的幸福，毅然决定把美洛嫁给所飒。在美洛和所飒举行婚礼的这一天，王后并没有到场，她不希望宴会上出现什么意外来破坏气氛。王后一个人悄悄走向海边，迎接着爱琴海的浪涛，蹈水自尽了。当人们怎么也找不到王后时，在海上发现了一只巨大的蟹，它的双臂环绕在胸前，缺乏安全感，赫拉知道这件事情以后也有些后悔，于是让那巨蟹在天上成为一个星座，它的形象就是一只巨蟹。
            二
            希腊神话里的一段故事强调了巨蟹座特有的攻击性：赫五力是宙斯与凡人生的儿子，天后希拉三番两次要置他于死：他也是希腊最伟大的英雄，世间最壮的人。世上没有他办不到的事，连神明们都是靠着他的协助才征服了巨人人族，当然，赫五力也为神明立下许多汗马功劳。有一天他来到了麦西尼王国，正淮备接受英雄式的欢迎，国王却因受到希拉的指使，给他出一道难题--杀掉住在沼泽区的九头蛇，这事很难办，因为每砍掉一个头便会马上生出无数个头。
            赫五力想到一个办法——用火烧焦蛇头，就这样轻易解决了八个蛇头。眼看只剩最后一个了，希拉在天上气得怒火中烧，难道这次又失败了？她不甘心啊！于是从海里叫来一支巨大的螃蟹要阻碍赫五力，巨蟹伸出了强有力的双蟹夹住赫五力的脚，但是谁都知道，赫五力是世间最壮的人啊！这支巨蟹最后仍死于他的蛮力之下。
            希拉又失败了，但对巨蟹不顾一切的牺牲，却感到心有戚戚，为了感佩巨蟹的忠于使命，即使没有成功，希拉仍将它放置在天上，也就成了巨蟹座。`,
    'shizi': `暂无传说神话`,
    'chunv': `在大约公元前十世纪，室女座的一部分被称为犁沟（The Furrow），代表女神莎拉（Shala）和她的谷穗。角宿一（室女座α）的拉丁名字便是Spica，意为谷穗，这是美索不达米亚平原最主要的农作物。 室女座的名称是从古代传下来的，拉丁名称Virgo，缩写为Vir，处女座的象征意为圣女、贞女、乙女、处女。
            天文学中处女座的形象是个长着翅膀的美丽女神。处女座同时也是天使，为人类带来福祉和美好。
            早期的希腊传说将室女座与谷神刻瑞斯（Ceres）和丰产女神得墨忒尔（Demeter）联系在一起。被认为是奥林匹斯十二主神之一的赫拉。地母盖亚以圣园的金苹果相赠，是古希腊神话中的天后，诸神之主，众神之女王，最高的女神。赫拉被认为是婚姻和妇女的保护神，赫拉拥有着女王般的优雅与尊荣，坐在黄金宝座上的赫拉异常美丽，华服香气四溢，双臂洁白如百合，一头华丽的卷发从华冠上飞泻下来。赫拉掌管着婚姻和生育，捍卫家庭，十分忠于她的爱情和家庭。通常青春女神赫柏被视为赫拉的处女相，赫拉本身代表母亲。又有说法称室女座与处女女神露斯蒂亚（Iustitia）或群星和正义女神阿斯特拉亚（Astraea）即纯洁女神阿斯翠亚Astraes有关，正义女神、群星女神、纯洁女神，带来了光明与希望，其形象是一个生有羽翼，手持火炬，散发璀璨光芒的少女。金色橄榄是圣洁女神阿斯翠亚对人类慈爱与怜悯的体现，拥有金色橄榄将拥有最高贵的美德。她为人类带来了光明与希望。她手上拿着一个正义的天平，被认为是天秤座。另一个希腊神话产生于后来的古典时期，认为室女座为埃里戈内（Erigone），雅典伊卡里斯（Icarius）的女儿。在这个神话的版本中，狄俄尼索斯把父亲和女儿分别放在了星星上，来扮演牧夫座和室女座。另一个被认为与室女座有关的人物是美丽的春之女神珀尔塞福涅（Persephone），她是人间管理谷物的女神、希腊的大地之母，她还是春天的灿烂女神，白臂珀耳塞福涅容貌美丽是一位满头金发的美女，珀耳塞福涅也是一位丰产女神，她是宙斯和得墨忒尔的独生女儿，哈迪斯早就爱上了这位倾国倾城的美丽女神，因哈迪斯爱慕，最美的珀耳塞福涅与冥王结婚，夏天住在冥界，她和哈迪斯育有三个儿子。 [12]  同时她也将春天带回人间，万物复苏，大地重回光明。
            处女座象征着美丽与纯洁。`,
    'tiancheng': '暂无传说神话',
    'tianxie': '暂无传说神话',
    'sheshou': '暂无传说神话',
    'mojie': '暂无传说神话',
    'shuiping': `
                古希腊神话中，众神之王宙斯的最爱，既不是天后赫拉，也不是他化身为公牛前去诱惑的欧罗巴公主，而是一名克里特美少年，伽倪墨得斯(加尼米德)。他化为雄鹰将这名美少年掳走，在奥林匹斯山上公然与之欢爱，引发赫拉的嫉妒并设计害死这名美少年，将之变为一只水瓶，宙斯伤心不已，将伽倪墨得斯的灵魂封印在天上，这就是水瓶座的由来。
            伽倪墨得斯是宙斯唯一的男性爱侣，但他同时也是独一无二的。宙斯是如此宠爱伽倪墨得斯，为了取悦伽倪墨得斯，他亲手为美丽的少年栽种了金葡萄藤。宙斯从未把任何一名女性带到奥林匹斯山或赐予她们不朽的神性，却唯独把伽倪墨得斯带到了奥林匹斯。
            宙斯对伽倪墨得斯的宠爱引来了天后赫拉的嫉妒，赫拉将伽倪墨得斯变成了一只透明的水瓶，要他永生永世为宙斯倒水，而水瓶中倒出来的却是眼泪，众神无不为之动容，于是宙斯便将伽倪墨得斯的灵魂封印在了天上，让他成为夜空中的星星，这就是水瓶座的由来。`,
    'shuangyu': '暂无传说神话'
}